blog/simple-tutorial-for-nubula.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Nebula 简易手册</title>
<!-- 2020-01-07 Tue 22:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">Nebula 简易手册</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 项目地址</a></li>
<li><a href="#sec-2">2. 其他教程链接</a></li>
</ul>
</div>
</div>
<p>
现在有三台机器A，B，C，分别对应
</p>

<pre class="example">
A【laptop】 比如你的MacBook，内网
B【lighthouse】 比如你的VPS，这个需要有公网IP
C【server】比如你的Ubuntu，内网
</pre>

<ol class="org-ol">
<li>安装软件，针对不同平台选择不同包<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>，然后下载解压到 /usr/local/bin 目录。
</li>

<li>进入B机器也就是lighthouse节点，我们先创建存放配置文件的目录。
</li>
</ol>
<pre class="example">
&gt; mkdir -p /etc/nebula/
</pre>

<p>
接着签发一个组织认证证书。
</p>
<pre class="example">
&gt; nebula-cert ca -name "Myorganization, Inc"
</pre>


<ol class="org-ol">
<li>还是在B机器，我们要签发B【lighthouse】和其他节点(A【laptop】C【server】)的证书。
</li>
</ol>
<pre class="example">
&gt; nebula-cert sign -name "lighthouse" -ip "192.168.100.1/24"
&gt; nebula-cert sign -name "laptop" -ip "192.168.100.2/24”
&gt; nebula-cert sign -name "server" -ip "192.168.100.3/24"
</pre>

<ol class="org-ol">
<li>将生成的 ca.crt, laptop.crt, laptop.key 复制到 A 机器一份。
再将 ca.crt, server.crt, server.key 复制到 B 机器一份。
</li>

<li>接下来，下载默认配置文件<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>到各个节点的 <i>etc/nebula</i> 目录下，命名为 config.yaml。然后，各节点配置修改如下关键点。
</li>
</ol>
<pre class="example">
lighthouse 节点：
1）pki 的证书对应路径，本例 B 节点是
 ca: /etc/nebula/ca.crt
 cert: /etc/nebula/lighthouse.crt
 key: /etc/nebula/lighthouse.key

2）am_lighthouse: true

3）static_host_map "192.168.100.1": ["公网IP:4242"]
</pre>
<p>
其他节点：
</p>

<pre class="example">
1）pki 的证书对应路径，
本例 A 节点是
 ca: /etc/nebula/ca.crt
 cert: /etc/nebula/laptop.crt
 key: /etc/nebula/laptop.key
本例 C 节点是
 ca: /etc/nebula/ca.crt
 cert: /etc/nebula/server.crt
 key: /etc/nebula/server.key

2）am_lighthouse: false 
3）static_host_map "192.168.100.1": ["公网IP:4242"]
</pre>
<ol class="org-ol">
<li>在所有节点启动应用
</li>
</ol>
<pre class="example">
nebula -config /etc/nebula/config.yaml
</pre>

<p>
P.S. 如果你用 ubuntu 机器 ping 不通你的macbook，可以打开系统偏好设置，关闭防火墙选项，或者取消勾选隐身模式
</p>

<p>
link：
</p>
<ul class="org-ul">
<li><sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup> <a href="https://github.com/slackhq/nebula/releases">https://github.com/slackhq/nebula/releases</a>
</li>
<li><sup><a id="fnr.2.100" name="fnr.2.100" class="footref" href="#fn.2">2</a></sup> <a href="https://github.com/slackhq/nebula/blob/master/examples/config.yml">https://github.com/slackhq/nebula/blob/master/examples/config.yml</a>
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 项目地址</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/slackhq/nebula">https://github.com/slackhq/nebula</a>
</p>

<p>
overlay network
竞品 tinc，zerotier，openvpn
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 其他教程链接</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://runtime.pw/nebula-tutorials/">https://runtime.pw/nebula-tutorials/</a>
</li>
<li><a href="https://runtime.pw/nebula-docker-compile/">https://runtime.pw/nebula-docker-compile/</a>
</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p>DEFINITION NOT FOUND.</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p>DEFINITION NOT FOUND.</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>